// 12. Напишите программу, которая будет принимать на
// вход два числа и выводить, является ли первое число
// кратным второму. Если число 1 не кратно числу 2, то
// программа выводит остаток от деления.
// 34, 5 -> не кратно, остаток 4
// 16, 4 -> кратно
// void Multiplicity(int arg1, int arg2)
// {
//     if (arg1 % arg2 == 0)
//         Console.WriteLine($"{numOne} кратно {numTwo}");
//     else
//         Console.WriteLine($"Остаток {arg1 % arg2}");
// }
// Console.Write("Введите первое число: ");
// int numOne = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число: ");
// int numTwo = Convert.ToInt32(Console.ReadLine());
// Multiplicity(numOne, numTwo);


